# m = [4, 'hello', True] # тип данных list - список 
# b = {5: 'hello', 'Hello':66} # Тип данных dict - словарь 
# c = (4, 'Hello', True) # Тип данных неизменяемый tuple - кортеж 
# x = {45,334, 'adil', 'azizov', True, 3,3} # Тип данных set - множество 

# print(f'{m}\n{b}\n{c}\n{x}') 

# n = str(input('Введите слова: '))
# m = 'tesla, Motors'

# print(n.lower()) # Тип данных для уменьшения символов 
# print(m.upper()) # Тип данных для увеличения символов 
# print(m.replace('Motors', 'Azizov')) # Метод смены символов 
# print(m.capitalize()) # Метод увеличивает первый символ слова
# print(m.title()) # Метод увеличивает каждый первый символ слова

# m = 12.6
# print(m//3) # Метод для вывода целого числа после деления 
# print(m%3) # Метод вывода остатка 
# print(m**2) # Метод возведения в степень 
# print(abs(m)) # Метод возвращения в абсолютное значение
# print(round(m)) # Метод округления 

#1
# n = int(input('Введите число:'))
# m = int(input('Введите число:'))
# x = m+n
# print('Сумма чисел равна:', x)
# #2
# a = int(input('Введите число:'))
# b = int(input('Введите число:'))
# P = a * b
# print('Площадь прямоугольника:', P)
# #3

# s = str(input('Введите имя:'))
# f = str(input('Введите фамилию:'))
# print(f'привет {s} {f} как дела?')

